---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ExistsForSelectedElement
source: html/2c0ea091-c1fe-a5b3-3141-633a6851de94.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ExistsForSelectedElement Property

Connections already exists for selected element.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExistsForSelectedElement { get; }
```